import { CommonModule } from '@angular/common';
import { Component } from '@angular/core';
import { CarouselModule, OwlOptions } from 'ngx-owl-carousel-o';
import { SearchComponent } from '../search/search.component';
@Component({
  selector: 'app-user-reviews',
  standalone: true,
  imports: [CarouselModule, CommonModule , SearchComponent ],
  templateUrl: './user-reviews.component.html',
  styleUrl: './user-reviews.component.scss'
})
export class UserReviewsComponent {


  products = [
    {
      name: 'مریم مصطفوی',
      score: '4.5',
      des: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است.',
      expertise: 'اطفال',
      doctor: 'دکتر محمد کیانی',
      date: '21 شهریور 1402'
    },
    {
      name: 'مریم مصطفوی',
      score: '4.5',
      des: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است.',
      expertise: 'اطفال',
      doctor: 'دکتر محمد کیانی',
      date: '21 شهریور 1402'
    },
    {
      name: 'مریم مصطفوی',
      score: '4.5',
      des: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است.',
      expertise: 'اطفال',
      doctor: 'دکتر محمد کیانی',
      date: '21 شهریور 1402'
    },
    {
      name: '4مریم مصطفوی',
      score: '4.5',
      des: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است.',
      expertise: 'اطفال',
      doctor: 'دکتر محمد کیانی',
      date: '21 شهریور 1402'
    },
    {
      name: 'مریم مصطفوی',
      score: '4.5',
      des: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است.',
      expertise: 'اطفال',
      doctor: 'دکتر محمد کیانی',
      date: '21 شهریور 1402'
    },
    {
      name: 'مریم مصطفوی',
      score: '4.5',
      des: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است.',
      expertise: 'اطفال',
      doctor: 'دکتر محمد کیانی',
      date: '21 شهریور 1402'
    },
    {
      name: 'مریم مصطفوی',
      score: '4.5',
      des: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است.',
      expertise: 'اطفال',
      doctor: 'دکتر محمد کیانی',
      date: '21 شهریور 1402'
    },
    {
      name: 'مریم مصطفوی',
      score: '4.5',
      des: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است.',
      expertise: 'اطفال',
      doctor: 'دکتر محمد کیانی',
      date: '21 شهریور 1402'
    },
    {
      name: 'مریم مصطفوی',
      score: '4.5',
      des: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است.',
      expertise: 'اطفال',
      doctor: 'دکتر محمد کیانی',
      date: '21 شهریور 1402'
    },
    {
      name: 'مریم مصطفوی',
      score: '4.5',
      des: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است.',
      expertise: 'اطفال',
      doctor: 'دکتر محمد کیانی',
      date: '21 شهریور 1402'
    },
    {
      name: 'مریم مصطفوی',
      score: '4.5',
      des: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است.',
      expertise: 'اطفال',
      doctor: 'دکتر محمد کیانی',
      date: '21 شهریور 1402'
    },
    {
      name: 'مریم مصطفوی',
      score: '4.5',
      des: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است.',
      expertise: 'اطفال',
      doctor: 'دکتر محمد کیانی',
      date: '21 شهریور 1402'
    },
    {
      name: 'مریم مصطفوی',
      score: '4.5',
      des: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است.',
      expertise: 'اطفال',
      doctor: 'دکتر محمد کیانی',
      date: '21 شهریور 1402'
    },
    {
      name: 'مریم مصطفوی',
      score: '4.5',
      des: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است.',
      expertise: 'اطفال',
      doctor: 'دکتر محمد کیانی',
      date: '21 شهریور 1402'
    },
    {
      name: 'مریم مصطفوی',
      score: '4.5',
      des: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است.',
      expertise: 'اطفال',
      doctor: 'دکتر محمد کیانی',
      date: '21 شهریور 1402'
    }
  ]


  customOptions: OwlOptions = {
    rtl: true,
    loop: true,
    margin: 24,
    nav: false,
    responsive: {
      0: {
        items: 1
      },
      400: {
        items: 2
      },
      740: {
        items: 3
      },
      940: {
        items: 4
      }
    },
  }

}
